src/cf/InformationRegisters/НастройкиУчетаНалогаНаПрибыльГруппОбособленныхПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНалогаНаПрибыльГруппОбособленныхПодразделений</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаНалогаНаПрибыльГруппОбособленныхПодразделений/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	НастройкиУчетаФормаСписка.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	// Настроим элементы отбора по региону
	// Не используем отбор через пользовательские настройки, т.к. список выбора региона настраивается специальной процедурой 
	Если Параметры.Отбор.Свойство("КодРегиона") Тогда
		ОтборКодРегиона              = Формат(Параметры.Отбор.КодРегиона, "ЧЦ=2; ЧН=; ЧВН=");
		ОтборКодРегионаИспользование = Истина;
	КонецЕсли;
	
	НастройкиУчетаНалогаНаПрибыльФормы.ЗаполнитьСписокВыбораРегиона(Элементы.ОтборКодРегиона.СписокВыбора, Истина);
		
	Если НЕ ОтборКодРегионаИспользование Тогда
		
		// Устанавливаем значение отбора, но не включаем сам отбор
		КодРегионаОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтборОрганизация, "РегистрацияВНалоговомОргане.КодРегиона");
		Если ЗначениеЗаполнено(КодРегионаОрганизации) Тогда
			ОтборКодРегиона = Формат(КодРегионаОрганизации, "ЧЦ=2; ЧН=; ЧВН=");
		ИначеЕсли ЗначениеЗаполнено(Элементы.ОтборКодРегиона.СписокВыбора) Тогда
			ОтборКодРегиона = Элементы.ОтборКодРегиона.СписокВыбора[0];
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	ПараметрыОповещения = Новый Структура;
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ПараметрыОповещения.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;	
	Оповестить("Запись_НастройкиНалогаНаПрибыльГруппыОбособленныхПодразделений", ПараметрыОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКодРегионаИспользованиеПриИзменении(Элемент)
	
	УстановитьОтборПоРегиону();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКодРегионаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтборКодРегиона) И ОтборКодРегиона <> "00" Тогда
		ОтборКодРегионаИспользование = Истина;
	КонецЕсли;
	
	УстановитьОтборПоРегиону();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборПоРегиону()
	
	ТипЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0));
	КодРегиона = ТипЧисло.ПривестиЗначение(ОтборКодРегиона);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		"КодРегиона",
		КодРегиона,
		,
		,
		ОтборКодРегионаИспользование);
				
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Настроим видимость колонки региона в списке
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НаименованиеРегиона");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборКодРегионаИспользование", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

#КонецОбласти
